app/controllers/find_recipe_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."ingredients" = ? LIMIT ?  [["ingredients", "flounder"], ["LIMIT", 1]]
---
    def show
        @recipes = Recipe.where('ingredients LIKE ?', "%#{params[:ingredient]}")