app/controllers/recipes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @instructions_array = @recipe.instructions.split('.')
    @ingredients_array = @recipe.ingredients.tr('[','').tr(']','').tr("'",'').split(',')
    if user_signed_in?
      @user = User.find(current_user.id)

SELECT "recipes".* FROM "recipes"
---
  def breakfast
    breakfast = []
    for recipe in Recipe.all

SELECT "recipes".* FROM "recipes"
---
  def lunch
    lunch = []
    for recipe in Recipe.all

SELECT "recipes".* FROM "recipes"
---
  def dinner
    dinner = []
    for recipe in Recipe.all

SELECT "recipes".* FROM "recipes"
---
  def desert
    desert = []
    for recipe in Recipe.all

SELECT "recipes".* FROM "recipes"
---
  def snack
    snack = []
    for recipe in Recipe.all