RecipeWebsite/app/controllers/recipes_controller.rb

  def breakfast
    breakfast = []
    for recipe in Recipe.all
---
SELECT "recipes".* FROM "recipes"

  def lunch
    lunch = []
    for recipe in Recipe.all
---
SELECT "recipes".* FROM "recipes"

  def dinner
    dinner = []
    for recipe in Recipe.all
---
SELECT "recipes".* FROM "recipes"

  def desert
    desert = []
    for recipe in Recipe.all
---
SELECT "recipes".* FROM "recipes"

  def snack
    snack = []
    for recipe in Recipe.all
---
SELECT "recipes".* FROM "recipes"